Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དེས་ཁྱིམ་གྱི་འབྱོར་པ་རྒྱ་ཆེན་པོ་བཤམས་ནས།
en: So he put the wealth of his household on extravagant display.

source: སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ཟླ་བ་གསུམ་གྱི་བར་དུ་སྤྱན་དྲངས་ཏེ། ཡོ་བྱད་ཐམས་ཅད་སྦྱར་ནས་
en: After hosting the Buddha and the rest of the saṅgha of monks for three months, providing for all their needs,

source: མཇུག་ཏུ་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་བཤོས་གསོལ་ཏེ། རེ་རེ་ལ་རས་ཟུང་རེ་ཕུལ་ནས་ཆོས་མཉན་པའི་ཕྱིར་སྤྱན་སྔར་འདུག་གོ། །
en: he offered the Buddha and the rest of the saṅgha of monks each a set of robes, and then sat before the Blessed One to listen to the Dharma.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་བསམ་པ་དང་བག་ལ་ཉལ་དང་ཁམས་དང་ཤེས་པ་དང་རང་བཞིན་ཐུགས་སུ་ཆུད་ནས།
en: The Blessed One directly apprehended his thoughts, habitual tendencies, temperament, capacity, and nature,

source: དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: and taught him the Dharma accordingly.

source: དེས་ན་བྲམ་ཟེ་འཁོར་དང་བཅས་པས་སྟན་དེ་ཉིད་ལ་འཁོད་བཞིན་དུ་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ་
en: Hearing it, the brahmin and the people of his house destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry right where they sat.

source: བདེན་པ་མཐོང་ནས་བྲམ་ཟེ་དེས་བསམས་པ་
en: Having seen the truths, the brahmin thought,

source: བདག་ཁྱིམ་ན་འདུག་པ་བཏང་ལ། བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་སྟེ་ཆུ་བོ་རྣམས་ལས་བརྒལ་བར་བྱ་བ་དང་སྦྱོར་བ་རྣམས་ལས་ཡང་དག་པར་འདའ་བར་བྱ་བའི་ཕྱིར་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་འབད་པར་བྱའོ་སྙམ་ནས
en: “I should give up living at home to go forth in the doctrine of the Blessed One, in order to ford the floodwaters and completely escape my fetters with diligence, practice, and effort.”

source: སྦྱིན་པ་དག་བྱིན་ཞིང་བསོད་ནམས་དག་བྱས་ཏེ་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ངོ་། །
en: So he gave gifts and generated merit. He went forth in the doctrine of the Blessed One,

source: དེ་ནས་དེས་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ཏེ།
en: and, casting away all afflictive emotions with diligence, practice, and effort, he manifested arhatship.

source: དེ་ནས་དགེ་སློང་དག་གིས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་བྲམ་ཟེ་འདིས་ལས་ཅི་ཞིག་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་ཞིང་ལས་སྐྱེས་པའི་ནས་ཀྱི་མྱུ་གུ་རྣམས་གསེར་གྱི་མྱུ་གུར་མཐོང་ལ།
en: “Lord,” the monks inquired of the Blessed One, “what action did this brahmin take that ripened into his seeing that the sprouts of barley growing in his field were sprouts of gold,

source: འདིས་བཅོམ་ལྡན་འདས་ཀྱང་མཉེས་པར་བགྱིས་ཏེ་མི་མཉེས་པར་མ་བགྱིས་ལ།
en: and that he pleased the Blessed One, did not displease him,

source: བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་ཡང་རབ་ཏུ་བྱུང་ནས་
en: went forth in the doctrine of the Blessed One,

source: དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་ལགས།
en: and manifested arhatship?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་འདས་པའི་ལས་ཀྱི་ཤས་ཀྱང་ཡོད་ལ། ད་ལྟར་གྱི་ལས་ཀྱི་ཤས་ཀྱང་ཡོད་དེ
en: “Monks,” the Blessed One replied, “it was partly his past actions, and it is partly his present actions as well.

source: འདས་པའི་ལས་གང་ཞེ་ན།
en: As for his past actions,

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་མཁྱེན་པ་སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: monks, in times past, in this fortunate eon, when people lived as long as twenty thousand years and the tathāgata, the arhat, the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world,

source: དེའི་གསུང་རབ་ལ་བྲམ་ཟེ་འདི་རབ་ཏུ་བྱུང་ནས།
en: this brahmin went forth in his doctrine.

source: དེས་དེར་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་དེ་འཆི་ཀར་སྨོན་ལམ་བཏབ་པ།
en: “He practiced pure conduct all his life, and at the time of his death, he prayed,

source: འདི་ལྟར་བདག་གིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ཀྱང་ཡོན་ཏན་གྱི་ཚོགས་ཅི་ཡང་མ་ཐོབ་ཀྱིས། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་བདག་གིས་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: ‘While I may not have attained any great virtues, still I have gone forth in the teaching of the totally and completely awakened Buddha Kāśyapa and practiced pure conduct all my life. By this root of virtue, may I please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.

source: དེའི་ཚེ་དེའི་དུས་ན་དགེ་སློང་དུ་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་བྲམ་ཟེ་འདི་ཁོ་ན་ཡིན་ཏེ།
en: The one who was that monk then is none other than this brahmin.

source: འདིས་ང་མཉེས་པར་བྱས་ཏེམི་མཉེས་པར་མ་བྱས་ལ་ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་པ་འདི་ནི་སྔོན་གྱི་ལས་ཡིན་ནོ། །
en: that he has pleased me, not displeased me, gone forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship. These were his past actions.

source: ད་ལྟར་གྱི་ལས་གང་ཞེ་ན།
en: “As for his present actions,

source: འདིས་ང་ལ་ཞལ་ཟས་ཕུལ་ནས་སྨོན་ལམ་བཏབ་སྟེ།
en: after offering me food, he prayed,

source: འཕྲལ་ཁོ་ནར་བདག་གི་དབུལ་བའི་རྒྱུན་ཆད་པར་གྱུར་ཅིག །
en: ‘May my poverty immediately come to an end.

source: བདག་གི་ནས་ཀྱི་མྱུ་གུ་འདི་རྣམས་ཀྱང་གསེར་གྱི་མྱུ་གུར་སྣང་བར་གྱུར་ལ་དེ་དག་ཀྱང་དེ་ཁོ་ན་བཞིན་དུ་གྱུར་ཅིག །
en: May all my sprouts of barley turn into sprouts of gold! May it be just so!

source: གཞན་དུ་མ་གྱུར་ཅིག་ཅེས་བྱས་པ་འདི་ནི་ད་ལྟར་གྱི་ལས་ཡིན་ནོ།། །།
en: May it not be otherwise.’ These were his present actions.”

source: ཤི་བ་ཞེས་བྱ་བ་ནི།
en: Death

source: གླེང་གཞི་རྒྱལ་པོའི་ཁབ་ན་བཞུགས་ཏེ། དེའི་ཚེ་རྒྱལ་པོའི་ཁབ་ན་བྲམ་ཟེ་ཞིག་གནས་པ་དེས་ཐབས་ཟླར་བབ་པ་ལས་ཆུང་མ་བླངས་ནས།
en: When the Blessed One was in Rājagṛha, there lived in Rājagṛha a certain brahmin. When the time came for him to marry, he took a wife,

source: དེ་དེ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་དོ། །
en: and as they enjoyed themselves and coupled, one day his wife conceived.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས་དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་ཁྱེའུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་ནས་
en: After nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful.

source: དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ཏེརིགས་དང་འཐུན་པར་མིང་བཏགས་ནས།
en: At the elaborate feast celebrating his birth they named him according to their clan.

source: དེ་ནས་དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ་ཡི་གེ་དང་བྲམ་ཟེའི་སྤྱོད་ལམ་དང་སྤྱོད་པ་དང་ཨོཾ་ཞེས་བྱ་བ་དང་བྷོ་ཞེས་བྱ་བ་དང་གཙང་སྦྲ་དང་ཆོ་ག་དང་ཐལ་བ་བླང་བ་དང་རིལ་བ་ཐོགས་པ་དང་ངེས་བརྗོད་ཀྱི་རིག་བྱེད་དང་མཆོད་སྦྱིན་གྱི་རིག་བྱེད་དང་སྙན་ཚིག་གི་རིག་བྱེད་དང་སྲིད་སྲུང་གི་རིག་བྱེད་དང་མཆོད་སྦྱིན་བྱ་བ་དང་མཆོད་སྦྱིན་བྱེད་དུ་གཞུག་པ་དང་སྦྱིན་པ་དང་བླང་བ་དང་ཁ་ཏོན་བྱ་བ་དང་ཁ་ཏོན་སློབ་ཏུ་གཞུག་པའི་ཐབས་བསླབས་ནས་ལས་རྣམ་པ་དྲུག་ལ་མཁས་པའི་བྲམ་ཟེར་གྱུར་ཏེདེ་མཐར་གྱིས་རིག་པའི་གནས་བཅྭ་བརྒྱད་ལ་བྱང་བར་གྱུར་ཏོ། །
en: and as he grew up he studied letters, brahminical customs and conduct, the syllables oṃ and bho , ritual purity, ritual actions , the collection of ashes, holding the ritual vase, the Ṛg Veda , the Yajur Veda , the Sāma Veda , the Atharva Veda , how to perform sacrificial rites, how to lead others in performing sacrificial rites, how to give and receive offerings, recitation, and recitation instruction. Trained in these procedures, he became a master of the six types of brahminical activities, and in time he mastered the eighteen sciences.

source: བྲམ་ཟེ་དེ་ཡང་ཕྱི་ཞིག་ན་སངས་རྒྱས་ལ་དད་པ་དང་ཆོས་དང་དགེ་འདུན་ལ་དད་པར་གྱུར་ཏེ། སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་བླངས་སོ། །
en: That brahmin, having found faith in the Buddha, and in the Dharma and the Saṅgha, went for refuge, and took the fundamental precepts.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོས་ཚིམ་པར་བྱས་ནས། ཆོས་མཉན་པའི་ཕྱིར་སྤྱན་སྔར་འདུག་གོ། །
en: One day he contented the Buddha and the rest of the saṅgha of monks with many good, wholesome foods, and then sat before them to listen to the Dharma.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་དེ་དང་འཚམ་པའི་ཆོས་བསྟན་ནས་གཤེགས་སོ། །
en: The Blessed One taught him the Dharma particularly suited to him, and departed.

source: དེ་ནས་ཕྱི་ཞིག་ན་བྲམ་ཟེ་དེ་ནད་ཀྱིས་ཐེབས་ནས།
en: Then one day the brahmin fell ill.

source: དེ་རྩ་བ་དང་སྡོང་བུ་དང་ལོ་མ་དང་མེ་ཏོག་དང་འབྲས་བུའི་སྨན་དག་གིས་རིམ་གྲོར་བྱས་ཀྱང་སོས་པར་བྱེད་མ་ནུས་ནས་ཤིའོ། །
en: Though he was treated with medicinal roots, stems, leaves, flowers, and fruits, he could not be cured, and died.

source: དེ་ཤི་འཕོས་ཏེ་དུས་ལས་འདས་ནས་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷའི་ནང་དུ་སྐྱེས་སོ། །
en: After his death, he transmigrated and took rebirth among the gods of the Heaven of the Thirty-Three.

source: དེ་ནས་བུ་དེས་ཀྱང་ཕའི་རུས་བུ་དེ་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལས་ཐག་མི་རིང་བ་ཞིག་ཏུ་ཕྱུང་སྟེ།
en: The brahmin’s son laid down his father’s remains not far from Vulture Peak Mountain, where they were cremated.

source: བསྲེགས་ནས་དེ་དུར་ཁྲོད་དེ་ཉིད་ན་འདུག་ཅིང་མྱ་ངན་བྱེད་ལ་སྡུག་བསྔལ་ཞིང་སྨྲེ་སྔགས་འདོན་ཏེ་
en: In misery he remained there in the charnel ground, suffering, lamenting, and beating his chest, wailing,

source: བྲང་རྡུང་ཞིང་ཕ་ཅིག་ཕ་ཅིག་ཅེས་ཆོ་ངེས་འདེབས་ཏེ་ཕན་ཚུན་འཁྱམ་ཞིང་འདུག་གོ། །
en: “My father, my only father!” and roaming all about.

source: ལྷའི་བུའམ་ལྷའི་བུ་མོ་སྐྱེས་མ་ཐག་པ་ན་ཆོས་ཉིད་ཀྱིས་སེམས་རྣམ་པ་གསུམ་སྐྱེ་བར་འགྱུར་ཏེ།
en: Now when young gods and goddesses are born they possess three different types of innate knowledge.

source: གང་ནས་ཤི་འཕོས་གང་དུ་སྐྱེས་ལས་གང་གི་སྐྱེས་སྙམ་མོ། །
en: They know (1) whence they have died and transmigrated, (2) where they have been born, and (3) why they have taken birth there.

source: དེ་ནས་མི་ལས་ཤི་འཕོས་པ་དང་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷར་སྐྱེས་པ་དང་བཅོམ་ལྡན་འདས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་བཀུར་སྟི་བྱས་ཏེ་སྐྱབས་སུ་སོང་བ་དང་བསླབ་པའི་གཞི་རྣམས་བསྲུངས་པར་དེས་མཐོང་ངོ་། །
en: The brahmin saw that when he died as a human being, having offered his respectful service to the Blessed One and the rest of the saṅgha of monks, taken refuge, and maintained the fundamental precepts, he had transmigrated and taken rebirth as a god in the Heaven of the Thirty-Three.

source: དེ་ནས་སྔོན་བྲམ་ཟེར་གྱུར་པའི་ལྷའི་བུ་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: The young god who formerly was the brahmin thought,

source: བདག་ཞག་ལོན་ནས་གཟོད་བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་བསྙེན་བཀུར་བྱེད་དུ་འགྲོ་བ་ནི་བདག་གི་ཆ་མ་ཡིན་གྱིས།
en: “It’s been a whole day since I approached the Blessed One and offered him my respect. This isn’t proper of me.

source: བདག་ཞག་མ་ལོན་པར་བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་འགྲོའོ་སྙམ་མོ། །
en: Not a day should pass without my seeing the Blessed One and offering him my respect.”

source: དེ་ནས་སྔོན་བྲམ་ཟེར་གྱུར་པའི་ལྷའི་བུ་རྣ་ཆ་གདུབ་ཀོར་དག་ཅིང་འགུལ་བ་ཐོགས་པ་ལུས་དོ་ཤལ་དང་སེ་མོ་དོས་བརྒྱན་པ་ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པའི་ཅོད་པན་ཅན་ལུས་གུར་གུམ་དང་ཏ་མའི་ལོ་མ་དང་སྤྲྀ་ཀ་ལ་སོགས་པས་བྱུགས་པ་དེས།
en: So he decorated himself with earrings, garlands, and strings of precious stones, put on a crown decorated with various types of precious jewels, and perfumed his body with saffron, tamala, spṛka, and other herbs.

source: དེ་ཉིད་ཀྱི་མཚན་མོ་ལྷའི་མེ་ཏོག་ཨུད་པ་ལ་དང་པད་མ་དང་ཀུ་མུ་ད་དང་པད་མ་དཀར་པོ་དང་མན་དཱ་ར་བ་རྣམས་ཀྱིས་ཐུ་བ་བཀང་སྟེ།
en: That night he filled the front of his long shirt with divine blue lotus, lotus, white water lily, white lotus, and mandārava flowers.

source: སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷའི་ནང་ནས་མི་སྣང་བར་གྱུར་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཕྱིན་ནས།
en: Disappearing from among the gods of the Heaven of the Thirty-Three, he approached the Blessed One,

source: བཅོམ་ལྡན་འདས་ལ་ལྷའི་མེ་ཏོག་ཨུད་པ་ལ་དང་པད་མ་དང་ཀུ་མུ་ད་དང་པད་མ་དཀར་པོ་དང་མན་དཱ་ར་བ་རྣམས་ཀྱིས་གཏོར་ཏེ།
en: scattered the divine blue lotus, lotus, white water lily, white lotus, and mandārava flowers over the Blessed One,

source: ཆོས་མཉན་པའི་ཕྱིར་སྤྱན་སྔར་འདུག་གོ། །
en: and sat before the Blessed One to listen to the Dharma.

source: དེས་ན་སྔོན་བྲམ་ཟེར་གྱུར་པའི་ལྷའི་བུ་དེས་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ
en: Hearing it, the young god who formerly was the brahmin destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry right where he sat.

source: དེས་བདེན་པ་མཐོང་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: Having seen the truths, he touched his head to the Blessed One’s feet,

source: བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཐད་ནས་མི་སྣང་བར་གྱུར་ཏེ།
en: circumambulated him three times, and disappeared from the Blessed One’s presence.

source: དེས་བལྟས་ན་བུ་དེ་དུར་ཁྲོད་ན་འདུག་ཅིང་ཤིན་ཏུ་མྱ་ངན་བྱེད་ལ་སྡུག་བསྔལ་ཞིང་སྨྲེ་སྔགས་འདོན་ཏེ།
en: Just then the young god looked out and saw his son in misery there in the charnel ground, suffering, lamenting, beating his chest, wailing,

source: བྲང་རྡུང་ཞིང་ཕ་ཅིག་ཕ་ཅིག་ཅེས་ཆོ་ངེ་འདོན་ཏེ། ཕན་ཚུན་དུ་འཁྱམ་ཞིང་འདུག་པ་མཐོང་ངོ་། །
en: “My father, my only father!” and roaming all about.

source: མཐོང་ནས་ཀྱང་བུའི་ཐད་དུ་སོང་སྟེ་སྨྲས་པ།
en: Seeing him so, he went to his son and said,

source: བུ་ང་ནི་མྱ་ངན་བྱར་མེད་པར་གྱུར་གྱིས་ངའི་ཕྱིར་ཧ་ཅང་མྱ་ངན་མ་བྱེད་ཅིག །
en: “My son, you needn’t mourn for me. Don’t mourn for me so.”

source: བུས་སྨྲས་པ། ཁྱོད་སུ་ཞིག །
en: “Who are you?” asked the son.

source: ལྷའི་བུས་སྨྲས་པ། ང་ནི་ཁྱོད་ཀྱི་ཕ་ཡིན་ནོ། །
en: The young god replied, “I am your father.”

source: བུས་སྨྲས་པ། ཁྱོད་གང་དུ་སྐྱེས།
en: “Where did you take rebirth?” asked the son.

source: ལྷའི་བུས་སྨྲས་པ། ལྷའི་ནང་དུ་སྐྱེས་སོ། །
en: The young god said, “I took birth among the gods.”

source: བུས་སྨྲས་པ། ཁྱོད་ཀྱིས་ལས་ཅི་ཞིག་བྱས།
en: “What action did you take to be born there?” asked the son.

source: ལྷའི་བུས་སྨྲས་པ། སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་བཀུར་སྟི་བྱས་ཏེ།
en: “I served the Buddha and the rest of the saṅgha of monks,” the young god replied,

source: སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་བསྲུངས་སོ། །
en: “and I took refuge and maintained the fundamental precepts.

source: བུ་ངའི་མྱ་ངན་མ་བྱེད་པར་ཁྱོད་བདག་གི་མྱ་ངན་བྱོས་ལ།
en: You needn’t mourn for me. Your concern should be for yourself.

source: བཅོམ་ལྡན་འདས་ལ་སྐྱབས་སུ་སོང་ཤིག་དང་།
en: Take refuge in the Blessed One.

source: དེ་ལས་ཁྱོད་ཀྱི་ལེགས་པ་ཐམས་ཅད་འབྱུང་བར་འགྱུར་རོ་ཞེས་བྱས་ནས
en: From him all good things will come to you.”

source: ལྷའི་བུ་དེ་དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་ཏེ་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷའི་ནང་དུ་སོང་ངོ་། །
en: Then the young god disappeared from that place and traveled up to be among the gods of the Heaven of the Thirty-Three.

source: བྲམ་ཟེའི་ཁྱེའུ་དེས་ཀྱང་ཕའི་ངག་མཉན་ནས་ཕའི་མྱ་ངན་སྤངས་ཏེ།
en: The brahmin’s son not only obeyed the words of his father and gave up mourning,

source: བཅོམ་ལྡན་འདས་ལ་ཡང་དགའ་བར་གྱུར་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: but in his joy toward the Blessed One he approached the Blessed One, touched his head to the Blessed One’s feet,

source: དེས་ན་བྲམ་ཟེ་དེས་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ།
en: Hearing it, the brahmin’s son destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry right where he sat.

source: དེས་བདེན་པ་མཐོང་ནས་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Having seen the truths, he rose from his seat, drew down the right shoulder of his upper garment, bowed toward the Blessed One with palms pressed together, and requested of the Blessed One,

source: བཙུན་པ་བདག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་བ་དང་བསྙེན་པར་རྫོགས་ཤིང་དགེ་སློང་གི་དངོས་པོ་འཐོབ་ཏུ་རུང་ན་
en: “Lord, if permitted I wish to go forth in the Dharma and Vinaya so well spoken, complete my novitiate, and achieve full ordination.

source: དེ་ནས་དེ་ལ་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་ཚུར་ཤོག་ཅེས་བྱ་བའི་ཚིག་གིས་རབ་ཏུ་ཕྱུང་སྟེ་བསྙེན་པར་རྫོགས་པར་མཛད་ནས་དེ་ལ་ལུང་ཡང་ཕོག་གོ། །
en: With the words “Come, join me, monk! Practice the holy life,” the Blessed One led him to go forth as a novice and conferred on him full ordination and instructed him.

source: དེ་ནས་དགེ་སློང་དག་གིས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ།
en: The monks inquired of the Blessed One,

source: བཙུན་པ་གཟིགས་ལགས། བྲམ་ཟེའི་ཁྱེའུ་མ་དད་པ་འདི་ཕས་དད་པ་ཕུན་སུམ་ཚོགས་པ་ལ་བཞག་སྟེ།
en: “Lord, tell us why this young brahmin who lacked faith was brought by his father to perfect faith,

source: འདི་རབ་ཏུ་བྱུང་ནས་བཅོམ་ལྡན་འདས་མཉེས་པར་བགྱིས་ཏེ་མི་མཉེས་པར་མ་བགྱིས་ལ་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་ལགས་སོ། །
en: went forth, pleased the Blessed One, did not displease him, cast all away all afflictive emotions, and manifested arhatship.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ད་ལྟར་འབའ་ཞིག་མ་ཡིན་ཏེ། འདས་པའི་དུས་ན་ཡང་བྲམ་ཟེའི་ཁྱེའུ་འདི་མ་དད་པ་ལས་ཕས་ཇི་ལྟར་དད་པ་ཕུན་སུམ་ཚོགས་པ་ལ་བཞག་པ་དང་འདི་རབ་ཏུ་བྱུང་ནས་
en: “Not only now,” the Blessed One explained, “but in times past as well, and in the same way, this young brahmin who lacked faith was brought by his father to perfect faith, went forth,

source: ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་པ་དེ་ཉོན་ཅིག །
en: and practiced pure conduct all his life. Listen well!

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: “Monks, in times past, in this fortunate eon, when people lived as long as twenty thousand years, and the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world,

source: དེའི་ཚེ་བཱ་རཱ་ཎ་སཱི་ན་བྲམ་ཟེ་ཞིག་གནས་པ་ལས།
en: there lived a certain brahmin in Vārāṇasī.

source: ཕྱི་ཞིག་ན་དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས། དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་ཁྱེའུ་ཞིག་བཙས་ཏེ།
en: “One day his wife conceived, and after nine or ten months had passed, she gave birth to a child.

source: གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ་ཡི་གེ་དང་བྲམ་ཟེའི་སྤྱོད་ལམ་དང་སྤྱོད་པ་དང་ཨོཾ་ཞེས་བྱ་བ་དང་བྷོ་ཞེས་བྱ་བ་དང་གཙང་སྦྲ་དང་ཆོ་ག་དང་ཐལ་བ་བླང་བ་དང་རིལ་བ་ཐོགས་པ་དང་ངེས་བརྗོད་ཀྱི་རིག་བྱེད་དང་མཆོད་སྦྱིན་གྱི་རིག་བྱེད་དང་སྙན་ཚིག་གི་རིག་བྱེད་དང་སྲིད་སྲུང་གི་རིག་བྱེད་དང་མཆོད་སྦྱིན་བྱ་བ་དང་མཆོད་སྦྱིན་བྱེད་དུ་གཞུག་པ་དང་སྦྱིན་པ་དང་བླང་བ་དང་ཁ་ཏོན་བྱ་བ་དང་ཁ་ཏོན་སློབ་ཏུ་གཞུག་པའི་ཐབས་བསླབས་ནས། ལས་རྣམ་པ་དྲུག་ལ་མཁས་པའི་བྲམ་ཟེར་གྱུར་ཏེ།
en: As he grew up, he studied letters, brahminical customs and conduct, the syllables oṃ and bho , ritual purity, ritual actions , the collection of ashes, holding the ritual vase, the Ṛg Veda , the Yajur Veda , the Sāma Veda , the Atharva Veda , how to perform sacrificial rites, how to lead others in performing sacrificial rites, how to give and receive offerings, recitation, and recitation instruction. Trained in these procedures, he became a master of the six types of brahminical activities,

source: དེ་མཐར་གྱིས་རིག་པའི་གནས་བཅྭ་བརྒྱད་ལ་བྱང་བར་གྱུར་ཏོ། །
en: and in time he mastered the eighteen sciences.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེའི་ཕ་སངས་རྒྱས་ལ་མངོན་པར་དགའ་བར་གྱུར། ཆོས་དང་དགེ་འདུན་ལ་མངོན་པར་དགའ་བར་གྱུར་ནས་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་བཟུང་ངོ་། །
en: “One day his father developed a deep admiration for the Buddha, and a deep admiration for the Dharma and the Saṅgha, and he took refuge and maintained the fundamental precepts.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེ་ཤི་འཕོས་ཏེ་དུས་ལས་འདས་ནས་ལྷའི་ནང་དུ་སྐྱེས་སོ། །
en: Then one day he died, transmigrated, and took rebirth among the gods.

source: བྲམ་ཟེའི་ཁྱེའུ་དེ་ནི་ཤིན་ཏུ་མྱ་ངན་བྱེད་ཅིང་སྨྲེ་སྔགས་འདོན་ཏེ།
en: In misery the brahmin’s son suffered, lamenting, beating his chest, wailing,

source: བྲང་རྡུང་ཞིང་ཕ་ཅིག་ཕ་ཅིག་ཅེས་ཆོ་ངེ་འདོན་ཏེ་ཕན་ཚུན་འཁྱམ་ཞིང་འདུག་གོ། །
en: ‘My father, my only father!’ and roaming all about.

source: དེ་ནས་དེའི་ཕས་དེ་ཚོར་ནས་དེའི་ཐད་དུ་སོང་སྟེ་སྨྲས་པ།
en: “Sensing this, his father went to him and said,

source: བུ་ཅིག་ང་ནི་མྱ་ངན་བྱར་མེད་པར་གྱུར་གྱིས་མྱ་ངན་མ་བྱེད་ཅིག །
en: ‘My son, you needn’t mourn for me. Don’t mourn for me so.’

source: དེས་སྨྲས་པ། ང་ནི་ཁྱོད་ཀྱི་ཕ་ཡིན་ནོ། །
en: “The young god replied, ‘I am your father.’

source: དེས་སྨྲས་པ། ལྷའི་ནང་དུ་སྐྱེས་སོ། །
en: “The young god said, ‘I took birth among the gods.’

source: དེས་སྨྲས་པ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ལ་བསྙེན་བཀུར་བྱས་ཏེ།
en: “ ‘I served the Buddha and the rest of the saṅgha of monks,’ the young god replied,

source: ད་ཁྱོད་ཀྱིས་ངའི་མྱ་ངན་མ་བྱེད་པར་ཁྱོད་བདག་གི་མྱ་ངན་བྱོས་ལ།
en: You needn’t mourn for me. Your concern should be for yourself.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ལ་སྐྱབས་སུ་སོང་ཤིག་དང་།
en: Take refuge in the totally and completely awakened Buddha Kāśyapa.

source: དེ་ལས་ཁྱོད་ཀྱི་ལེགས་པ་ཐམས་ཅད་འབྱུང་བར་འགྱུར་རོ་ཞེས་བྱས་ནས་
en: From him all good things will come to you.’

source: ལྷའི་བུ་དེ་མི་སྣང་བར་གྱུར་ཏོ། །
en: “The young god disappeared,

source: བྲམ་ཟེའི་ཁྱེའུ་དེས་ཀྱང་ཕའི་ངག་མཉན་ཏེ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས།
en: and the young brahmin not only obeyed the words of his father, but went forth in the doctrine of Buddha Kāśyapa.

source: དེས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་དེ་འཆི་ཀར་སྨོན་ལམ་བཏབ་པ།
en: After practicing pure conduct all his life, at the time of his death he prayed,

source: འདི་ལྟར་བདག་གིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ཀྱང་བདག་གིས་ཡོན་ཏན་གྱི་ཚོགས་ཅི་ཡང་མ་ཐོབ་ཀྱིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་བདག་གིས་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག་མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: ‘While I may not have attained any great virtues, still I have gone forth in the doctrine of the totally and completely awakened Buddha Kāśyapa and practiced pure conduct all my life. Therefore, may I please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.

source: དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེའི་ཁྱེའུའི་ཕར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་བྲམ་ཟེ་འདི་ཉིད་ཡིན་ནོ། །
en: The one who was the father of that young brahmin then is none other than this brahmin.

source: དེའི་ཚེ་བུར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་བུ་འདི་ཉིད་ཡིན་ཏེ།
en: The one who was his son then is none other than this young man.

source: དེའི་ཚེ་ཡང་འདིས་ཕ་ལས་བརྟེན་ཏེ་དད་པ་རྙེད་ནས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་དོ། །
en: At that time, he entrusted himself to his father, found faith, and practiced the holy life all his life.

source: ད་ལྟར་ཡང་འདིས་ཕ་དེ་ཉིད་ལས་བརྟེན་ནས་དད་པ་རྙེད་དེ། ངའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ།། །།
en: Now as well, he has entrusted himself to his father, gone forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.”

source: ཀོ་ཀ་ལི་ཀ་ཞེས་བྱ་བ་ནི།
en: A Story about Kokālika

source: གླེང་གཞི་རྒྱལ་པོའི་ཁབ་ན་བཞུགས་ཏེ། དེའི་ཚེ་ཚེ་དང་ལྡན་པ་ཀོ་ཀ་ལི་ཀ་སབ་ཀང་རི་ལ་འཇིགས་བྱེད་མའི་ཚལ་རི་དགས་ཀྱི་ནགས་ན་གནས་ཏེ།
en: When the Blessed One was in Rājagṛha, Venerable Kokālika was living in the deer park in The Terrifying Forest on Mount Sabkang.
